In [19]:
import numpy as np
import pandas as pd

In [ ]:
labels = ['him1','him2','him3']
list = [10,20,30]
arr = np.array([1,2,3])
d = {'a':10,'b':20,'c':30}

In [ ]:
pd.Series(data = list, index = 'a b c'.split())

In [ ]:
pd.Series(data = list, index = labels)

In [ ]:
pd.Series(data = arr, index = list)

In [ ]:
pd.Series(d)

Data Frames

In [20]:
from numpy.random import randint

In [21]:
np.random.seed(200)

In [22]:
df = pd.DataFrame(randint(0,100,20).reshape(5,4),index = 'A B C D E'.split(),columns = 'W X Y Z'.split())

In [23]:
df

    W   X   Y   Z
A  26  16  68  42
B  55  76  79  89
C  14  91  57  89
D  11   6  42  56
E   1   7  51  27

In [24]:
df['W']

A    26
B    55
C    14
D    11
E     1
Name: W, dtype: int32

In [25]:
df['Z']

A    42
B    89
C    89
D    56
E    27
Name: Z, dtype: int32

In [26]:
x = df[['X','W']]

In [27]:
type(x)

pandas.core.frame.DataFrame

In [28]:
df.loc['A']

W    26
X    16
Y    68
Z    42
Name: A, dtype: int32

In [31]:
df.loc[['C','D','E'],['X','Y','Z']]

    X   Y   Z
C  91  57  89
D   6  42  56
E   7  51  27

In [32]:
df.loc[['C','D','E'],['X','Y','Z']][['X','Y']]

    X   Y
C  91  57
D   6  42
E   7  51

axis = 0 signifies rows and axis = 1 signifies columns

In [33]:
df['new'] = 1,2,3,4,5

In [34]:
df

    W   X   Y   Z  new
A  26  16  68  42    1
B  55  76  79  89    2
C  14  91  57  89    3
D  11   6  42  56    4
E   1   7  51  27    5

In [35]:
df.drop('new', axis = 1)

    W   X   Y   Z
A  26  16  68  42
B  55  76  79  89
C  14  91  57  89
D  11   6  42  56
E   1   7  51  27

In [36]:
df

    W   X   Y   Z  new
A  26  16  68  42    1
B  55  76  79  89    2
C  14  91  57  89    3
D  11   6  42  56    4
E   1   7  51  27    5

In [37]:
df.drop('new', axis = 1, inplace = True)

In [38]:
df

    W   X   Y   Z
A  26  16  68  42
B  55  76  79  89
C  14  91  57  89
D  11   6  42  56
E   1   7  51  27

In [40]:
df.iloc[2]

W    14
X    91
Y    57
Z    89
Name: C, dtype: int32

In [52]:
df.iloc[[2,3,4],[1,2,3]]

    X   Y   Z
C  91  57  89
D   6  42  56
E   7  51  27

What is difference between set and reset_index

What is differnece between reshape and resize

In [55]:
df['W'] > 20

A     True
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [56]:
df[df['W'] > 20]

    W   X   Y   Z
A  26  16  68  42
B  55  76  79  89

In [59]:
df[(df['W'] > 10) | (df['Z'] < 80)]

    W   X   Y   Z
A  26  16  68  42
B  55  76  79  89
C  14  91  57  89
D  11   6  42  56
E   1   7  51  27

In [63]:
df[df['Y'] == 79]

    W   X   Y   Z
B  55  76  79  89

In [61]:
df[df['X'] > 70][['Y','Z']]

    Y   Z
B  79  89
C  57  89